{  "title": "Flipkart Diwali 2018 sale",
  "description": "Deals on Nokia 5.1 Plus, Realme 2 Pro, Redmi Note 5 Pro, more mobiles under Rs 15,000",
  "body": "Flipkart Diwali 2018 sale is now live with deals and discounts on mobiles, laptops, electronics, fashion products and more. During the sale, which will continue till November 5, those who purchase using SBI Bank credit card users can avail 10 per cent instant discount. The site is also offering discounts on budget phones like Xiaomi Redmi Note 5 Pro, Honor 9N, Asus Zenfone Max M1, etc. Nokia 5.1 Plus is also on offer during the festive sale. Let us take a look at the top budget smartphone discounts under Rs 15,000:\nNokia 5.1 Plus is the newest budget device from HMD Global and it comes with a glass body design, taller display. The phone feels premium for its price, thanks to smooth curved edges. It sports a 5.86-inch HD+ display with a notch on top and aspect ratio of 19:9. The phone was launched at a price of Rs 10,999 for the 3GB RAM and 32GB storage model.\nIn our review, we said Nokia 5.1 Plus impresses when it comes to performance and battery. We did not encounter any lag or stutter even with several tabs open in Chrome browser, playing games and switching between apps. The dual rear cameras manage to render vibrant images with decent details in good lighting condition. The phone stands out in the budget segment, courtesy of its classy design and clean software experience. Read our full review of Nokia 5.1 Plus.\nRealme 2 Pro with dewdrop notch design, dual rear cameras is listed at a starting price Rs 13,990 for 4GB RAM and 64GB storage option. This is among the better mid-range options to buy, courtesy its sharp display, modern design, brilliant imaging sensors and capable processing hardware. The performance is good when it comes to daily usage.\nRealme 2 Pro is also available in a 6GB RAM and 64GB storage variant, priced at Rs 15,990. The top-model with 8GB RAM and 128GB storage costs Rs 17,990. In addition, people can avail up to Rs 13,000 off on exchange as well as 10 per cent instant discount on SBI credit cards. Read our full review of Realme 2 Pro.\nHonor 9N was launched at a starting price of Rs 11,999 for base storage model (3GB RAM+32GB ROM), though it will be selling for Rs 9,999 during the sale. The 4GB RAM and 64GB storage model gets Rs 2,000 off and is listed for a price of Rs 11,999. Those planning to Honor 9N will not regret their decision as the company has cut the corners to make the phone beat the competition.",
  "tags": ["electronics","mobiles","sale"],
  "image": "null",
  "timestamp": "null"
}
